
. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. use "D:\r2.dta"

. gen year = substr(AssesmentDate, -4, 4)

. 
end of do-file

. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. // use "D:\r2.dta"
. // gen year = substr(AssesmentDate, -4, 4)
. 
. *********************************************************************************
. ******run these stata codes before runing the Python codes for this CP
. 
. **************clean OSH management systems
. 
. replace QCleaned="does the factory have a valid business license?" if QCleaned=="
> has the factory submitted a notice to the chief inspector before starting operati
> ons?" & Country=="Bangladesh"
(227 real changes made)

. //one item asked in different ways in Bangladesh
. 
. replace CPCleaned="osh management systems" if QCleaned=="mechanisms/committee for
>  cooperation on osh"
(0 real changes made)

. 
. 
. replace QCleaned=Q if Q=="does the workplace have a functioning hiv/aids committe
> e?"
(2,503 real changes made)

. //2503; rectify coding error in Cambodia
. 
. replace QCleaned="mechanisms/committee for cooperation on osh" if Q=="has the emp
> loyer developed mechanisms to ensure cooperation between workers and management o
> n osh matters?"
(2,503 real changes made)

. //2503 changed, Cambodia
. 
. replace disclosed=1 if QCleaned=="mechanisms/committee for cooperation on osh" 
(3,087 real changes made)

. //3087 changed; right contribute distribution
. 
. 
. replace QCleaned="does the factory have a written osh policy?" if QCleaned=="is t
> here an adequate osh policy that is signed by top management?" & Country=="Cambod
> ia"
(1,350 real changes made)

. 
. replace QCleaned="has the employer performed an assessment of general occupationa
> l safety and health issues in the factory?" if Q=="does the employer conduct risk
>  assessment?"
(1,802 real changes made)

. 
. replace QCleaned="has the employer performed an assessment of general occupationa
> l safety and health issues in the factory?" if Q=="does the employer conduct regu
> lar hazards and risk assessment?"
(502 real changes made)

. 
. replace QCleaned="does the factory have a written osh policy?" if regexm(Q,"does 
> the employer have written plans for osh programs?|does the employer have a writte
> n policy and plans for osh programs?")
(476 real changes made)

. 
. duplicates tag QuestID if Country=="Jordan" & year=="2015" & QCleaned=="does the 
> factory have a written osh policy?",gen(JDdup)

Duplicates in terms of QuestID

. 
. drop if index==470616
(1 observation deleted)

. drop if index==470687
(1 observation deleted)

.  //two identical questions in Jordan in 2015
.  
. drop JDdup

. 
. replace QCleaned="does the employer investigate work-related accidents and indica
> te the technical recommendations necessary to prevent them?" if regexm(Q,"does th
> e employer investigate work-related accidents and indicate the technical recommen
> dations necessary to prevent them?|does the employer record and investigate work-
> related accidents and illnesses, and indicate the technical recommendations neces
> sary to prevent them?")
(122 real changes made)

. 
. replace QCleaned="has legal construction permits/structural safety certificate" i
> f Q=="does the employer have legally required construction/building permits?"
(4,317 real changes made)

. 
. replace QCleaned="has legal construction permits/structural safety certificate" i
> f Q=="does the employer ensure the building is safe and maintain legally required
>  permits"
(0 real changes made)

. 
. replace QCleaned="does the employer record work-related accidents?" if Q=="does t
> he employer record work-related accidents and diseases and submit the record to o
> fatma on a monthly basis?"
(161 real changes made)

. //161 changes, asked differently in Haiti
. 
. 
. replace QCleaned="has legal construction permits/structural safety certificate"
(1,246,324 real changes made)

. if QCleaned=="does the factory have a valid business license?" & Country=="Jordan
> "
{ required
r(100);

end of do-file

r(100);

. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. replace QCleaned="has legal construction permits/structural safety certificate"
(0 real changes made)

. if QCleaned=="does the factory have a valid business license?" & Country=="Jordan
> "
{ required
r(100);

end of do-file

r(100);

. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. replace QCleaned="has legal construction permits/structural safety certificate" i
> f QCleaned=="does the factory have a valid business license?" & Country=="Jordan"
(0 real changes made)

. 
end of do-file

. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. use "D:\r2.dta"
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. // use "D:\r2.dta"
. // gen year = substr(AssesmentDate, -4, 4)
. 
end of do-file

. do "C:\Users\JselZ\AppData\Local\Temp\STD3fd0_000000.tmp"

. // use "D:\r2.dta"
. // gen year = substr(AssesmentDate, -4, 4)
. 
. *********************************************************************************
. ******run these stata codes before runing the Python codes for this CP
. 
. **************clean OSH management systems
. 
. replace QCleaned="does the factory have a valid business license?" if QCleaned=="
> has the factory submitted a notice to the chief inspector before starting operati
> ons?" & Country=="Bangladesh"
(0 real changes made)

. //one item asked in different ways in Bangladesh
. 
. replace CPCleaned="osh management systems" if QCleaned=="mechanisms/committee for
>  cooperation on osh"
(0 real changes made)

. 
. 
. replace QCleaned=Q if Q=="does the workplace have a functioning hiv/aids committe
> e?"
(2,503 real changes made)

. //2503; rectify coding error in Cambodia
. 
. replace QCleaned="mechanisms/committee for cooperation on osh" if Q=="has the emp
> loyer developed mechanisms to ensure cooperation between workers and management o
> n osh matters?"
(2,558 real changes made)

. //2503 changed, Cambodia
. 
. replace disclosed=1 if QCleaned=="mechanisms/committee for cooperation on osh" 
(0 real changes made)

. //3087 changed; right contribute distribution
. 
. 
. replace QCleaned="does the factory have a written osh policy?" if QCleaned=="is t
> here an adequate osh policy that is signed by top management?" & Country=="Cambod
> ia"
(0 real changes made)

. 
. replace QCleaned="has the employer performed an assessment of general occupationa
> l safety and health issues in the factory?" if Q=="does the employer conduct risk
>  assessment?"
(1,802 real changes made)

. 
. replace QCleaned="has the employer performed an assessment of general occupationa
> l safety and health issues in the factory?" if Q=="does the employer conduct regu
> lar hazards and risk assessment?"
(502 real changes made)

. 
. replace QCleaned="does the factory have a written osh policy?" if regexm(Q,"does 
> the employer have written plans for osh programs?|does the employer have a writte
> n policy and plans for osh programs?")
(474 real changes made)

. 
. duplicates tag QuestID if Country=="Jordan" & year=="2015" & QCleaned=="does the 
> factory have a written osh policy?",gen(JDdup)

Duplicates in terms of QuestID

. 
. drop if index==470616
(0 observations deleted)

. drop if index==470687
(0 observations deleted)

.  //two identical questions in Jordan in 2015
.  
. drop JDdup

. 
. replace QCleaned="does the employer investigate work-related accidents and indica
> te the technical recommendations necessary to prevent them?" if regexm(Q,"does th
> e employer investigate work-related accidents and indicate the technical recommen
> dations necessary to prevent them?|does the employer record and investigate work-
> related accidents and illnesses, and indicate the technical recommendations neces
> sary to prevent them?")
(122 real changes made)

. 
. replace QCleaned="has legal construction permits/structural safety certificate" i
> f Q=="does the employer have legally required construction/building permits?"
(0 real changes made)

. 
. replace QCleaned="has legal construction permits/structural safety certificate" i
> f Q=="does the employer ensure the building is safe and maintain legally required
>  permits"
(0 real changes made)

. 
. replace QCleaned="does the employer record work-related accidents?" if Q=="does t
> he employer record work-related accidents and diseases and submit the record to o
> fatma on a monthly basis?"
(161 real changes made)

. //161 changes, asked differently in Haiti
. 
. 
. replace QCleaned="has legal construction permits/structural safety certificate" i
> f QCleaned=="does the factory have a valid business license?" & Country=="Jordan"
(0 real changes made)

. 
. 
. *********************************************************************************
. *****run these  in full to clean some CPs
. 
. *****************************************************************************
. *****************overtime wages CP 
. 
. replace CPCleaned="overtime wages" if CP=="premium pay"
(7,776 real changes made)

. 
. replace QCleaned="Correct pay for work on public holidays" if regexm(QCleaned,"do
> es the employer pay all workers correctly for work on public holidays?|does the e
> mployer pay workers 100% more than their normal wage for all overtime hours worke
> d on national holidays?|does the employer pay workers 150% of their normal wage f
> or overtime worked on weekly rest days and public holidays?|does the employer pay
>  all workers correctly for work on public holidays?")
(0 real changes made)

. 
. replace QCleaned="Correct pay for work on public holidays" if Q=="does the employ
> er pay workers 50% above the normal wage when workers work regular hours on legal
> ly mandated holidays?"
(161 real changes made)

. //161 changes, one item in Haiti grouped under "premium pay"
. 
. 
. replace QCleaned="Correct pay for overtime at night" if regexm(Q,"does the employ
> er pay workers correctly for all overtime hours worked at night?|does the employe
> r pay workers double their normal wage for all overtime hours worked at night?")
(4,157 real changes made)

. 
. replace QCleaned="Correct pay for overtime at weekly rest days" if regexm(Q,"does
>  the employer pay workers correctly for all overtime hours worked on weekly rest 
> days?|does the employer pay workers double their normal wage for all hours worked
>  on weekly rest days?|does the employer pay workers 100% more than their normal w
> age for all overtime hours worked on weekly rest days?")
(4,424 real changes made)

. 
. replace QCleaned="Correct pay for overtime at weekly rest days" if Q=="does the e
> mployer pay workers 50% above the normal wage when workers work regular hours on 
> weekly rest days?"
(161 real changes made)

. //161 changed. combine 1 in Haiti with others
. 
. replace QCleaned="Correct pay for overtime at weekly rest days" if regexm(Q,"does
>  the employer pay workers correctly when they take compensatory days off after wo
> rking on weekly rest days?")
(584 real changes made)

. //584 changed; Combine one item in Bangladesh with those in other countries
. 
. 
. 
. replace QCleaned="Correct pay for overtime at weekly rest days" if regexm(Q,"does
>  the employer provide meals and drinks of at least 1,400 calories to workers work
> ing overtime for 3 hours or more?|does the employer provide meals and drinks of a
> t least 1,400 calories to workers working overtime for 4 hours or more?")
(834 real changes made)

. //834 changed, combine one item in Indonesia with those in Cambodia and Jordan
. 
. 
. replace QCleaned="Correct pay for work on public holidays" if QCleaned=="does the
>  employer pay piece rate workers correctly for all overtime hours worked on regul
> ar work days?" 
(0 real changes made)

. //584 changed, combine one item in Balgdesh with those in other countries
. 
. 
. drop if regexm(Q,"does the employer pay workers 100% above the normal wage for al
> l overtime hours worked at night?|does the employer pay workers 100% above the no
> rmal wage for overtime hours worked on legally mandated holidays?|does the employ
> er pay workers 100% above the normal wage for overtime hours worked on weekly res
> t days?|does the employer comply with national law regarding payment for regular 
> working hours worked at night?") & Country=="Haiti"
(320 observations deleted)

. //320 deleted; 4 items only asked in 2015-2018 in Haiti
. 
. 
. drop if Q=="does the factory incorporate all required allowances and additional p
> ayments into the calculation of wage-based benefits (e.g. social insurance paymen
> ts, overtime, paid leave, etc.)?"
(1,555 observations deleted)

. //1555 deleted; 1 item only in Vietnam and not asked in 2015
. 
. 
. drop if Q=="does the employer pay at least 5% higher than the normal applicable w
> age level for workers who perform hazardous and dangerous work?"
(1,775 observations deleted)

. //1775 deleted; 1 unique item only asked in Vietnam
. 
. 
. drop if Q=="does the employer pay all workers the correct meal allowance or give 
> them a reasonable free meal when they work overtime?" & Country=="Cambodia"
(2,503 observations deleted)

. //2503 deleted; one item only asked in Cambodia
. 
. 
. drop if QCleaned=="Correct pay for overtime at night" 
(4,157 observations deleted)

. //4157 deleted; one item only in Cambodia, Nicaragua, and Vietnam
. 
. drop if QCleaned=="does the employer pay workers correctly for regular working ho
> urs worked at night?"
(0 observations deleted)

. //only asked in Cambodia and Vietnam
. 
. 
. ********************************************************************************
. **********clean Prison Labour CP
. 
. replace QCleaned="prison labor consent and same treatment" if regexm(Q,"if prison
>  labour is used, do the prisoners receive similar treatment to non-prison workers
>  working in the factory?|if prison labour is used, have the prisoners freely cons
> ented to do the work; do they receive similar treatment to non-prison workers; an
> d is the work carried out under the supervision and control of a public authority
> ?|if prison labour is used, have the prisoners freely consented to do the work?")
(7,044 real changes made)

. 
. 
. drop if Q=="if prison labour is used, is the work carried out under the supervisi
> on and control of a public authority?" & Country=="Indonesia"
(833 observations deleted)

. //833 deleted; similar item only in Indonesia 
. 
. 
. drop if Q=="if prison labour is used, have the prisoners freely consented to do t
> he work?" & Country=="Indonesia"
(833 observations deleted)

. //833 deleted; similar item only in Indonesia 
. 
. 
end of do-file

. save "D:\r3.dta"
file D:\r3.dta saved

. log using "D:\Git\labor_audit\CY\0621run.log"
-----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\Git\labor_audit\CY\0621run.log
  log type:  text
 opened on:  21 Jun 2024, 15:08:20

. log close
      name:  <unnamed>
       log:  D:\Git\labor_audit\CY\0621run.log
  log type:  text
 closed on:  21 Jun 2024, 15:09:08
-----------------------------------------------------------------------------------

. 
